backEnd/app/controllers/application_controller.rb

  def current_member
    @current_member ||= Member.find_by_id(session[:member_id])
---
SELECT "members".* FROM "members" WHERE "members"."id" IS NULL LIMIT $1  [["LIMIT", 1]]