backEnd/app/controllers/bulletins_controller.rb

    def index
        render json: Bulletin.all, status: :ok #200
---
SELECT "bulletins".* FROM "bulletins"

    def destroy
        @bulletin.destroy
---
DELETE FROM "bulletins" WHERE "bulletins"."id" = $1  [["id", 1]]

    def set_bulletin
        @bulletin = Bulletin.find(params[:id])
---
SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]