backEnd/app/controllers/members_controller.rb

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        current_member = Member.find_by_id(session[:member_id])

INSERT INTO "members" ("username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        member = Member.create!(member_params)