backEnd/app/controllers/sessions_controller.rb

    def create
        member = Member.find_by(username: params[:username])
---
SELECT "members".* FROM "members" WHERE "members"."username" = $1 LIMIT $2  [["username", "Jaivon"], ["LIMIT", 1]]